<template>
  <h3 class="fw-bold mb-4 mt-2 text-primary">หลักสูตรวิทยาการคอมพิวเตอร์</h3>

  <h4>ปรัชญาของหลักสูตร</h4>
  <p>
    บัณฑิตวิทยาการคอมพิวเตอร์ คุณภาพวิขการดี ปฎิบัติเป็น เน็นคุณธรรม
    ก้าวทันเทคโนโลยี
  </p>

  <h4>ความสำคัญของหลักสูตร</h4>
  <p>
    หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์
    เป็นหลักสูตรที่ครอบคลุมทั้ง ด้านทฤษฎี และปฏิบัติ
    ซึ่งเป็นพื้นฐานที่จะนำไปสู่การพัฒนาองค์ความรู้ รวมถึงสามารถประยุกต์ใช้ใน
    การทำงานต่าง ๆ ที่มีพื้นฐานทางวิทยาการคอมพิวเตอร์ได์เป็นอย่างดี
    จึงเป็นหลักสูตรที่สามารถผลิต บัณฑิตที่มีความรู้ความสามารถ และมีคุณธรรม
    สอดคล้องกับความต้องการของประเทศในยุคเศรษฐกิจ และสังคมดิจิทัล
  </p>
  <h4>วัตถุประสงค์ของหลักสูตร</h4>
  <ul>
    <li>
      เพื่อผลิตบัณฑิตที่มีความรู้ความสามารถด้านวิทยาการคอมพิวเตอร์
      มีความคิดริเริ่มสร้างสรรค์ สามารถปรับตัวให้เข้ากับการเปลี่ยนแปลงในปัจจุบัน
    </li>
    <li>
      เพื่อผลิตบัณฑิตที่มีความรู้ความสามารถในการประกอบวิชาชีพทางคอมพิวเตอร์
      เพื่อตอบสนองความต้องการของท้องถิ่งและสังคม
    </li>
    <li>
      เพื่อผลิตบัณฑิตให้มีความรู้ควาสามารถในการพัฒนาตนเองหรือศึกษาในระดับที่สูงขึ้นได้
    </li>
    <li>
      เพื่อผลิตบัณฑิตที่มีคุณธรรม จริยธรรม และทักษะชีวิต มีความรับผิดชอบต่อสังคม
    </li>
  </ul>
</template>

<script setup></script>

<style scoped></style>
